Revit 2024 API
BuiltInFailures.SketchFailures.CannotHaveArcs Property
 Sorry, we can't use arcs here.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotHaveArcs { get; }
Visual Basic
Public Shared ReadOnly Property CannotHaveArcs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotHaveArcs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace